from src.enums import MixSpeed

DEFAULT_MIX_SPEED = MixSpeed.speed_5

WATER_ML_REP_SECOND = 10

COFFEE_SETTINGS = {
    "prebrewingTime": 0,
    "prebrewingWaterRatio": 0,
    "restorationTime": 0.3,
    "secondSqueezeForce": 90,
    "secondSqueezeTime": 2,
    "squeezeForce": 90,
    "squeezeTime": 2
}

discharge_speeds = {
    "Ваниль": ((3, 1.77), (9, 4.65)),
    "Шоколад": ((3, 1.75), (9, 4.76)),
    "Сливки": ((3, 1.42), (9, 3.8)),
    "Сахар": ((3, 2.8), (9, 6.9)),
    "МШ | Ваниль": ((3, 2.0), (9, 5.6)),
}

# значения для 220 (временно, нужно переделать по файл с конфигами)
jl220_ds = {
    "Ваниль": ((3, ...), (9, ...)),
    "Шоколад": ((3, ...), (9, ...)),
    "Сливки": ((3, 1.67), (9, ...)),
    "Сахар": ((3, 2.8), (9, 6.9)),
    "МШ | Ваниль": ((3, 2.0), (9, 5.6)),
}

canister_ids = {
    "N JL24": {
        "Ваниль": 1,
        "Сливки": 2,
        "Шоколад": 3,
    },
    "N JL220": {
        "МШ | Ваниль": 1,
        "Ваниль": 2,
        "Шоколад": 3,
        "Сливки": 4,
        "Сахар": 5,
    },
    "N JL25": {
        "Сахар": 999, # костыль из-за неправильной архитектуры (при создании перебираются все напитки и все компоненты)
        "МШ | Ваниль": 1,
        "Ваниль": 1,
        "Сливки": 2,
        "Шоколад": 3,
    },
}
